DouglasBgs/ESP32CamLib/src/ESP32CamLib.cpp
#include "ESP32CamLib.h"
#include <dummy.h>
#include <stdio.h>
#include <SD_MMC.h>

#include "settings.h"

//#define LOG_LOCAL_LEVEL ESP_LOG_VERBOSE
#include "esp_log.h"
#include "esp_camera.h"
#include "esp_system.h"
#include "esp_task_wdt.h"

// MicroSD
#include "driver/sdmmc_host.h"
#include "driver/sdmmc_defs.h"
#include "sdmmc_cmd.h"
#include "esp_vfs_fat.h"

// CAMERA_MODEL_AI_THINKER
#include "camSettings.h"
// AVI FILE SETTINGS
#include "aviSettings.h"

#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"
#include "soc/cpu.h"
#include "soc/rtc_cntl_reg.h"

#include "driver/rtc_io.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "nvs_flash.h"
#include "nvs.h"

TaskHandle_t CameraTask, AviWriterTask;
SemaphoreHandle_t baton;

void codeForAviWriterTask(void *parameter)
{
    uint32_t ulNotifiedValue;
    Serial.print("aviwriter, core ");
    Serial.print(xPortGetCoreID());
    Serial.print(", priority = ");
    Serial.println(uxTaskPriorityGet(NULL));

    for (;;)
    {
        ulNotifiedValue = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        while (ulNotifiedValue-- > 0)
        {
            make_avi();
            count_avi++;
            delay(1);
        }
    }
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
// CameraTask runs on cpu 1 to take pictures and drop them in a queue
//

void codeForCameraTask(void *parameter)
{
    int pic_delay = 0;
    int next = 0;
    long next_run_time = 0;
    Serial.print("camera, core ");
    Serial.print(xPortGetCoreID());
    Serial.print(", priority = ");
    Serial.println(uxTaskPriorityGet(NULL));

    for (;;)
    {

        if (other_cpu_active == 1)
        {
            current_millis = millis();
            count_cam++;
            xSemaphoreTake(baton, portMAX_DELAY);

            int q_size = (fb_in + fb_max - fb_out) % fb_max;

            if (q_size + 1 == fb_max)
            {
                xSemaphoreGive(baton);

                Serial.print(" Queue Full, Skipping ... "); // the queue is full
                skipped++;
                skipped++;
                skipping = 1;
                next = 3 * capture_interval;
            }
            else
            {
                frames_so_far++;
                frame_cnt++;

                fb_in = (fb_in + 1) % fb_max;
                bp = millis();

                do
                {
                    fb_q[fb_in] = esp_camera_fb_get();
                    int x = fb_q[fb_in]->len;
                    int foundffd9 = 0;

                    for (int j = 1; j <= 1025; j++)
                    {
                        if (fb_q[fb_in]->buf[x - j] != 0xD9)
                        {
                        }
                        else
                        {

                            if (fb_q[fb_in]->buf[x - j - 1] == 0xFF)
                            {

                                if (j == 1)
                                {
                                    normal_jpg++;
                                }
                                else
                                {
                                    extend_jpg++;
                                }
                                if (j > 1000)
                                { //  never happens. but > 1 does, usually 400-500
                                    Serial.print("Frame ");
                                    Serial.print(frames_so_far);
                                    Serial.print(", Len = ");
                                    Serial.print(x);
                                    Serial.print(", Corrent Len = ");
                                    Serial.print(x - j + 1);
                                    Serial.print(", Extra Bytes = ");
                                    Serial.println(j - 1);
                                }
                                foundffd9 = 1;
                                break;
                            }
                        }
                    }

                    if (!foundffd9)
                    {
                        bad_jpg++;
                        Serial.print("Bad jpeg, Len = ");
                        Serial.println(x);
                        esp_camera_fb_return(fb_q[fb_in]);
                    }
                    else
                    {
                        break;
                    }

                } while (1);

                totalp = totalp - bp + millis();
                pic_delay = millis() - current_millis;
                xSemaphoreGive(baton);
                last_capture_millis = millis();

                if (q_size == 0)
                {
                    if (skipping == 1)
                    {
                        Serial.println(" Queue cleared. ");
                        skipping = 0;
                    }
                    next = capture_interval - pic_delay;
                    if (next < 2)
                        next = 2;
                }
                else if (q_size < 2)
                {
                    next = capture_interval - pic_delay;
                    if (next < 2)
                        next = 2;
                }
                else if (q_size < 4)
                {
                    next = capture_interval;
                }
                else
                {
                    next = 2 * capture_interval;
                    skipped++;
                }
            }

            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            vTaskNotifyGiveFromISR(AviWriterTask, &xHigherPriorityTaskWoken);

            delay(next);
            next_run_time = millis() + next;
        }
        else
        {
            next_run_time = millis() + capture_interval;
            delay(capture_interval);
        }
    }
}

//
// Writes an uint32_t in Big Endian at current file position
//
static void inline print_quartet(unsigned long i, FILE *fd)
{
    uint8_t y[4];

    y[0] = i % 0x100;
    y[1] = (i >> 8) % 0x100;
    y[2] = (i >> 16) % 0x100;
    y[3] = (i >> 24) % 0x100;

