DouglasBgs/ESP32CamLib/src/ESP32CamLib.cpp
    size_t i1_err = fwrite(y, 1, 4, fd);
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//  delete_old_stuff() - before every avi, delete oldest day if freespace less than 10%
//
//  code copied from user @gemi254

void delete_old_stuff()
{

    Serial.printf("Total space: %lluMB\n", SD_MMC.totalBytes() / (1024 * 1024));
    Serial.printf("Used space: %lluMB\n", SD_MMC.usedBytes() / (1024 * 1024));

    float full = 1.0 * SD_MMC.usedBytes() / SD_MMC.totalBytes();
    ;
    if (full < 0.8)
    {
        Serial.printf("Nothing deleted, %.1f%% disk full\n", 100.0 * full);
    }
    else
    {
        Serial.printf("Disk is %.1f%% full ... deleting oldest day\n", 100.0 * full);
        int oldest = 22222222;
        char oldestname[50];

        File f = SD_MMC.open("/");
        if (f.isDirectory())
        {

            File file = f.openNextFile();
            while (file)
            {
                if (file.isDirectory())
                {

                    char foldname[50];
                    strcpy(foldname, file.name());
                    int i = atoi(foldname);
                    if (i > 20200000 && i < oldest)
                    {
                        strcpy(oldestname, file.name());
                        oldest = i;
                    }
                }
                file = f.openNextFile();
            }
            deleteFolderOrFile(oldestname);
            f.close();
        }
    }
}

void deleteFolderOrFile(const char *val)
{
    char val_w_slash[60];
    sprintf(val_w_slash, "/%s", val);
    Serial.printf("Deleting : %s\n", val_w_slash);
    File f = SD_MMC.open(val_w_slash);
    if (!f)
    {
        Serial.printf("Failed to open %s\n", val_w_slash);
        return;
    }

    if (f.isDirectory())
    {
        File file = f.openNextFile();
        while (file)
        {
            if (file.isDirectory())
            {
                Serial.print("  DIR : ");
                Serial.println(file.name());
            }
            else
            {
                char file_w_slash[100];
                sprintf(file_w_slash, "%s/%s", val_w_slash, file.name());
                Serial.print("  FILE: ");
                Serial.print(file_w_slash);
                Serial.print("  SIZE: ");
                Serial.print(file.size());

                if (SD_MMC.remove(file_w_slash))
                {
                    Serial.println(" deleted.");
                }
                else
                {
                    Serial.println(" FAILED.");
                }
            }
            file = f.openNextFile();
        }
        f.close();
        // Remove the dir
        if (SD_MMC.rmdir(val_w_slash))
        {
            Serial.printf("Dir %s removed\n", val_w_slash);
        }
        else
        {
            Serial.println("Remove dir failed");
        }
    }
    else
    {
        // Remove the file
        if (SD_MMC.remove(val_w_slash))
        {
            Serial.printf("File %s deleted\n", val_w_slash);
        }
        else
        {
            Serial.println("Delete failed");
        }
    }
}

void init_tasks()
{

    Serial.println("\n\n---");

    rtc_gpio_hold_dis(GPIO_NUM_33);
    pinMode(33, OUTPUT);   // little red led on back of chip
    digitalWrite(33, LOW); // turn on the red LED on the back of chip

    rtc_gpio_hold_dis(GPIO_NUM_4);
    pinMode(4, OUTPUT);   // Blinding Disk-Avtive Light
    digitalWrite(4, LOW); // turn off

    Serial.setDebugOutput(true);
    Serial.print("setup, core ");
    Serial.print(xPortGetCoreID());
    Serial.print(", priority = ");
    Serial.println(uxTaskPriorityGet(NULL));

    total_frames = total_frames_config;

    if (!psramFound())
    {
        Serial.println("paraFound wrong - major fail");
        major_fail();
    }

    Serial.println("Starting sd card ...");

    // SD camera init
    card_err = init_sdcard();
    if (card_err != ESP_OK)
    {
        Serial.printf("SD Card init failed with error 0x%x", card_err);
        major_fail();
        return;
    }

    Serial.printf("Total space: %lluMB\n", SD_MMC.totalBytes() / (1024 * 1024));
    Serial.printf("Used space: %lluMB\n", SD_MMC.usedBytes() / (1024 * 1024));

    Serial.println("Starting tasks ...");

    baton = xSemaphoreCreateMutex(); // baton controls access to camera and frame queue

    xTaskCreatePinnedToCore(
        codeForCameraTask,
        "CameraTask",
        1024, // heap available for this task
        NULL,
        2, // prio 2 - higher number is higher priio
        &CameraTask,
        1); // core 1

    delay(20);

    xTaskCreatePinnedToCore(
        codeForAviWriterTask,
        "AviWriterTask",
        3072, // heap
        NULL,
        3, // prio 3
        &AviWriterTask,
        0); // on cpu 0

    delay(20);

    Serial.println("Starting camera ...");

    recording = 0; // we are NOT recording
    config_camera();

    newfile = 0; // no file is open  // don't fiddle with this!

    recording = record_on_reboot;

    ready = 1;
    digitalWrite(33, HIGH); // red light turns off when setup is complete

    xTaskNotifyGive(AviWriterTask);

    delay(1000);

    if (delete_old_files)
        delete_old_stuff();
}

//
// if we have no camera, or sd card, then flash rear led on and off to warn the human SOS - SOS
//
void major_fail()
{

    Serial.println(" ");

    for (int i = 0; i < 10; i++)
    { // 10 loops or about 100 seconds then reboot
        for (int j = 0; j < 3; j++)
        {
            digitalWrite(33, LOW);
            delay(150);
            digitalWrite(33, HIGH);
            delay(150);
        }

        delay(1000);

        for (int j = 0; j < 3; j++)
        {
            digitalWrite(33, LOW);
            delay(500);
            digitalWrite(33, HIGH);
            delay(500);
        }

        delay(1000);
        Serial.print("Major Fail  ");
        Serial.print(i);
        Serial.print(" / ");
        Serial.println(10);
    }

