DouglasBgs/ESP32CamLib/src/ESP32CamLib.cpp
    ESP.restart();
}

static esp_err_t init_sdcard()
{

    // pinMode(12, PULLUP);
    pinMode(13, PULLUP);
    // pinMode(4, OUTPUT);

    esp_err_t ret = ESP_FAIL;
    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    host.flags = SDMMC_HOST_FLAG_1BIT; // using 1 bit mode
    host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
    diskspeed = host.max_freq_khz;
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width = 1; // using 1 bit mode
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 8,
    };

    sdmmc_card_t *card;

    ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &card);

    if (ret == ESP_OK)
    {
        Serial.println("SD card mount successfully!");
    }
    else
    {
        Serial.printf("Failed to mount SD card VFAT filesystem. Error: %s", esp_err_to_name(ret));
        Serial.println("Try again...");
        delay(5000);
        diskspeed = 400;
        host.max_freq_khz = SDMMC_FREQ_PROBING;
        ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &card);
        if (ret == ESP_OK)
        {
            Serial.println("SD card mount successfully SLOW SLOW SLOW");
        }
        else
        {
            Serial.printf("Failed to mount SD card VFAT filesystem. Error: %s", esp_err_to_name(ret));
            major_fail();
        }
    }
    sdmmc_card_print_info(stdout, card);
    Serial.print("SD_MMC Begin: ");
    Serial.println(SD_MMC.begin());
    return ret;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
// Make the avi move in 4 pieces
//
// make_avi() called in every loop, which calls below, depending on conditions
//   start_avi() - open the file and write headers
//   another_pic_avi() - write one more frame of movie
//   end_avi() - write the final parameters and close the file

void make_avi()
{

    if (newfile == 0 && recording == 1)
    { // open the file

        digitalWrite(33, HIGH);
        newfile = 1;

        if (delete_old_files)
            delete_old_stuff();

        start_avi(); // now start the avi
    }
    else
    {

        // we have a file open, but not recording

        if (newfile == 1 && recording == 0)
        { // got command to close file

            digitalWrite(33, LOW);
            end_avi();

            Serial.println("Done capture due to command");

            frames_so_far = total_frames;

            newfile = 0;   // file is closed
            recording = 0; // DO NOT start another recording
        }
        else
        {

            if (newfile == 1 && recording == 1)
            { // regular recording

                if ((millis() - startms) > (total_frames * capture_interval))
                { // time is up, even though we have not done all the frames

                    Serial.println(" ");
                    Serial.println("Done capture for time");
                    Serial.print("Time Elapsed: ");
                    Serial.print(millis() - startms);
                    Serial.print(" Frames: ");
                    Serial.println(frame_cnt);
                    Serial.print("Config:       ");
                    Serial.print(total_frames * capture_interval);
                    Serial.print(" (");
                    Serial.print(total_frames);
                    Serial.print(" x ");
                    Serial.print(capture_interval);
                    Serial.println(")");

                    digitalWrite(33, LOW); // close the file

                    end_avi();

                    frames_so_far = 0;
                    newfile = 0; // file is closed
                    recording = 0;
                }
                else
                { // regular

                    another_save_avi();
                }
            }
        }
    }
}

static void config_camera()
{

    camera_config_t config;

    if (new_config == 5)
    {

        config.ledc_channel = LEDC_CHANNEL_0;
        config.ledc_timer = LEDC_TIMER_0;
        config.pin_d0 = Y2_GPIO_NUM;
        config.pin_d1 = Y3_GPIO_NUM;
        config.pin_d2 = Y4_GPIO_NUM;
        config.pin_d3 = Y5_GPIO_NUM;
        config.pin_d4 = Y6_GPIO_NUM;
        config.pin_d5 = Y7_GPIO_NUM;
        config.pin_d6 = Y8_GPIO_NUM;
        config.pin_d7 = Y9_GPIO_NUM;
        config.pin_xclk = XCLK_GPIO_NUM;
        config.pin_pclk = PCLK_GPIO_NUM;
        config.pin_vsync = VSYNC_GPIO_NUM;
        config.pin_href = HREF_GPIO_NUM;
        config.pin_sscb_sda = SIOD_GPIO_NUM;
        config.pin_sscb_scl = SIOC_GPIO_NUM;
        config.pin_pwdn = PWDN_GPIO_NUM;
        config.pin_reset = RESET_GPIO_NUM;
        config.xclk_freq_hz = 20000000;
        config.pixel_format = PIXFORMAT_JPEG;

        config.frame_size = FRAMESIZE_UXGA;

        fb_max = 6;              // 74.5 from 7                      // for vga and uxga
        config.jpeg_quality = 6; // 74.5 from 7

        config.fb_count = fb_max + 1;

        // camera init
        cam_err = esp_camera_init(&config);
        if (cam_err != ESP_OK)
        {
            Serial.printf("Camera init failed with error 0x%x", cam_err);
            major_fail();
        }

        new_config = 2;
    }

    delay(100);

    sensor_t *ss = esp_camera_sensor_get();
    ss->set_quality(ss, quality);
    ss->set_framesize(ss, (framesize_t)framesize);
    if (gray == 1)
    {
        ss->set_special_effect(ss, 2); // 0 regular, 2 grayscale
    }
    else
    {
        ss->set_special_effect(ss, 0); // 0 regular, 2 grayscale
    }
    ss->set_brightness(ss, 1);  // up the blightness just a bit
    ss->set_saturation(ss, -2); // lower the saturation

    for (int j = 0; j < 5; j++)
    {
        do_fb(); // start the camera ... warm it up
        delay(50);
    }
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
// start_avi - open the files and write in headers
//

static void start_avi()
{

    Serial.println("Starting an avi ");

    SD_MMC.mkdir(strftime_buf2);

