DouglasBgs/ESP32CamLib/src/ESP32CamLib.cpp
    Serial.print("\nFile name will be >");
    Serial.print(fname);
    Serial.println("<");

    avifile = fopen(fname, "w");
    idxfile = fopen("/sdcard/idx.tmp", "w");

    if (avifile == NULL)
    {
        Serial.println("Could not open file");
        major_fail();
    }

    if (idxfile == NULL)
    {
        Serial.println("Could not open file");
        major_fail();
    }

    for (i = 0; i < AVIOFFSET; i++)
    {
        char ch = pgm_read_byte(&avi_header[i]);
        buf[i] = ch;
    }

    size_t err = fwrite(buf, 1, AVIOFFSET, avifile);
    // v99 - uxga 13, hd 11, svga 9, vga 8, cif 6
    if (framesize == 8)
    {

        fseek(avifile, 0x40, SEEK_SET);
        err = fwrite(vga_w, 1, 2, avifile);
        fseek(avifile, 0xA8, SEEK_SET);
        err = fwrite(vga_w, 1, 2, avifile);
        fseek(avifile, 0x44, SEEK_SET);
        err = fwrite(vga_h, 1, 2, avifile);
        fseek(avifile, 0xAC, SEEK_SET);
        err = fwrite(vga_h, 1, 2, avifile);
    }
    else if (framesize == 13)
    {

        fseek(avifile, 0x40, SEEK_SET);
        err = fwrite(uxga_w, 1, 2, avifile);
        fseek(avifile, 0xA8, SEEK_SET);
        err = fwrite(uxga_w, 1, 2, avifile);
        fseek(avifile, 0x44, SEEK_SET);
        err = fwrite(uxga_h, 1, 2, avifile);
        fseek(avifile, 0xAC, SEEK_SET);
        err = fwrite(uxga_h, 1, 2, avifile);
    }
    else if (framesize == 11)
    {

        fseek(avifile, 0x40, SEEK_SET);
        err = fwrite(hd_w, 1, 2, avifile);
        fseek(avifile, 0xA8, SEEK_SET);
        err = fwrite(hd_w, 1, 2, avifile);
        fseek(avifile, 0x44, SEEK_SET);
        err = fwrite(hd_h, 1, 2, avifile);
        fseek(avifile, 0xAC, SEEK_SET);
        err = fwrite(hd_h, 1, 2, avifile);
    }
    else if (framesize == 9)
    {

        fseek(avifile, 0x40, SEEK_SET);
        err = fwrite(svga_w, 1, 2, avifile);
        fseek(avifile, 0xA8, SEEK_SET);
        err = fwrite(svga_w, 1, 2, avifile);
        fseek(avifile, 0x44, SEEK_SET);
        err = fwrite(svga_h, 1, 2, avifile);
        fseek(avifile, 0xAC, SEEK_SET);
        err = fwrite(svga_h, 1, 2, avifile);
    }
    else if (framesize == 6)
    {

        fseek(avifile, 0x40, SEEK_SET);
        err = fwrite(cif_w, 1, 2, avifile);
        fseek(avifile, 0xA8, SEEK_SET);
        err = fwrite(cif_w, 1, 2, avifile);
        fseek(avifile, 0x44, SEEK_SET);
        err = fwrite(cif_h, 1, 2, avifile);
        fseek(avifile, 0xAC, SEEK_SET);
        err = fwrite(cif_h, 1, 2, avifile);
    }

    fseek(avifile, AVIOFFSET, SEEK_SET);

    Serial.print(F("\nRecording "));
    Serial.print(total_frames);
    Serial.println(F(" video frames ...\n"));

    startms = millis();
    totalp = 0;
    totalw = 0;
    jpeg_size = 0;
    movi_size = 0;
    uVideoLen = 0;
    idx_offset = 4;

    frame_cnt = 0;
    frames_so_far = 0;

    skipping = 0;
    skipped = 0;
    bad_jpg = 0;
    extend_jpg = 0;
    normal_jpg = 0;

    newfile = 1;
    other_cpu_active = 1;

} // end of start avi

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//  another_save_avi runs on cpu 1, saves another frame to the avi file
//
//  the "baton" semaphore makes sure that only one cpu is using the camera subsystem at a time
//

static void another_save_avi()
{

    xSemaphoreTake(baton, portMAX_DELAY);

    if (fb_in == fb_out)
    { // nothing to do

        xSemaphoreGive(baton);
        nothing_avi++;
    }
    else
    {

        fb_out = (fb_out + 1) % fb_max;

        int fblen;
        fblen = fb_q[fb_out]->len;

        if (BlinkWithWrite)
        {
            digitalWrite(33, LOW);
        }

        jpeg_size = fblen;
        movi_size += jpeg_size;
        uVideoLen += jpeg_size;

        bw = millis();
        size_t dc_err = fwrite(dc_buf, 1, 4, avifile);
        size_t ze_err = fwrite(zero_buf, 1, 4, avifile);

        int time_to_give_up = 0;
        while (ESP.getFreeHeap() < 35000)
        {
            Serial.print(time_to_give_up);
            Serial.print(" Low on heap ");
            Serial.print(ESP.getFreeHeap());
            Serial.print(" frame q = ");
            Serial.println((fb_in + fb_max - fb_out) % fb_max);
            if (time_to_give_up++ == 50)
                break;
            delay(100 + 5 * time_to_give_up);
        }

        size_t err = fwrite(fb_q[fb_out]->buf, 1, fb_q[fb_out]->len, avifile);

        time_to_give_up = 0;
        while (err != fb_q[fb_out]->len)
        {
            Serial.print("Error on avi write: err = ");
            Serial.print(err);
            Serial.print(" len = ");
            Serial.println(fb_q[fb_out]->len);
            time_to_give_up++;
            if (time_to_give_up == 10)
                major_fail();
            Serial.print(time_to_give_up);
            Serial.print(" Low on heap !!! ");
            Serial.println(ESP.getFreeHeap());

            delay(1000);
            size_t err = fwrite(fb_q[fb_out]->buf, 1, fb_q[fb_out]->len, avifile);
        }

        esp_camera_fb_return(fb_q[fb_out]); // release that buffer back to the camera system
        xSemaphoreGive(baton);

        remnant = (4 - (jpeg_size & 0x00000003)) & 0x00000003;

        print_quartet(idx_offset, idxfile);
        print_quartet(jpeg_size, idxfile);

        idx_offset = idx_offset + jpeg_size + remnant + 8;

        jpeg_size = jpeg_size + remnant;
        movi_size = movi_size + remnant;
        if (remnant > 0)
        {
            size_t rem_err = fwrite(zero_buf, 1, remnant, avifile);
        }

        fileposition = ftell(avifile);                          // Here, we are at end of chunk (after padding)
        fseek(avifile, fileposition - jpeg_size - 4, SEEK_SET); // Here we are the the 4-bytes blank placeholder

        print_quartet(jpeg_size, avifile); // Overwrite placeholder with actual frame size (without padding)

        fileposition = ftell(avifile);

        fseek(avifile, fileposition + jpeg_size, SEEK_SET);

        totalw = totalw + millis() - bw;

        digitalWrite(33, HIGH);
    }
} // end of another_pic_avi

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//  end_avi runs on cpu 1, empties the queue of frames, writes the index, and closes the files
//

static void end_avi()
{

    unsigned long current_end = 0;

    other_cpu_active = 0; // shuts down the picture taking program

