DouglasBgs/ESP32CamLib/src/ESP32CamLib.cpp
    for (int i = 0; i < fb_max; i++)
    { // clear the queue
        another_save_avi();
    }
    current_end = ftell(avifile);

    Serial.println("End of avi - closing the files");

    elapsedms = millis() - startms;
    float fRealFPS = (1000.0f * (float)frame_cnt) / ((float)elapsedms) * xspeed;
    float fmicroseconds_per_frame = 1000000.0f / fRealFPS;
    uint8_t iAttainedFPS = round(fRealFPS);
    uint32_t us_per_frame = round(fmicroseconds_per_frame);

    // Modify the MJPEG header from the beginning of the file, overwriting various placeholders

    fseek(avifile, 4, SEEK_SET);
    print_quartet(movi_size + 240 + 16 * frame_cnt + 8 * frame_cnt, avifile);

    fseek(avifile, 0x20, SEEK_SET);
    print_quartet(us_per_frame, avifile);

    unsigned long max_bytes_per_sec = movi_size * iAttainedFPS / frame_cnt;

    fseek(avifile, 0x24, SEEK_SET);
    print_quartet(max_bytes_per_sec, avifile);

    fseek(avifile, 0x30, SEEK_SET);
    print_quartet(frame_cnt, avifile);

    fseek(avifile, 0x8c, SEEK_SET);
    print_quartet(frame_cnt, avifile);

    fseek(avifile, 0x84, SEEK_SET);
    print_quartet((int)iAttainedFPS, avifile);

    fseek(avifile, 0xe8, SEEK_SET);
    print_quartet(movi_size + frame_cnt * 8 + 4, avifile);

    Serial.println(F("\n*** Video recorded and saved ***\n"));
    Serial.print(F("Recorded "));
    Serial.print(elapsedms / 1000);
    Serial.print(F("s in "));
    Serial.print(frame_cnt);
    Serial.print(F(" frames\nFile size is "));
    Serial.print(movi_size + 12 * frame_cnt + 4);
    Serial.print(F(" bytes\nActual FPS is "));
    Serial.print(fRealFPS, 2);
    Serial.print(F("\nMax data rate is "));
    Serial.print(max_bytes_per_sec);
    Serial.print(F(" byte/s\nFrame duration is "));
    Serial.print(us_per_frame);
    Serial.println(F(" us"));
    Serial.print(F("Average frame length is "));
    Serial.print(uVideoLen / frame_cnt);
    Serial.println(F(" bytes"));
    Serial.print("Average picture time (ms) ");
    Serial.println(1.0 * totalp / frame_cnt);
    Serial.print("Average write time (ms)   ");
    Serial.println(totalw / frame_cnt);
    Serial.print("Frames Skipped % ");
    Serial.println(100.0 * skipped / frame_cnt, 2);
    Serial.print("Normal jpg % ");
    Serial.println(100.0 * normal_jpg / frame_cnt, 1);
    Serial.print("Extend jpg % ");
    Serial.println(100.0 * extend_jpg / frame_cnt, 1);
    Serial.print("Bad    jpg % ");
    Serial.println(100.0 * bad_jpg / total_frames, 1);

    Serial.println("Writing the index");

    fseek(avifile, current_end, SEEK_SET);

    fclose(idxfile);

    size_t i1_err = fwrite(idx1_buf, 1, 4, avifile);

    print_quartet(frame_cnt * 16, avifile);

    idxfile = fopen("/sdcard/idx.tmp", "r");

    if (idxfile != NULL)
    {
        Serial.printf("File open: %s\n", "/sdcard/idx.tmp");
    }
    else
    {
        Serial.println("Could not open file");
    }

    char *AteBytes;
    AteBytes = (char *)malloc(8);

    for (int i = 0; i < frame_cnt; i++)
    {
        size_t res = fread(AteBytes, 1, 8, idxfile);
        size_t i1_err = fwrite(dc_buf, 1, 4, avifile);
        size_t i2_err = fwrite(zero_buf, 1, 4, avifile);
        size_t i3_err = fwrite(AteBytes, 1, 8, avifile);
    }

    free(AteBytes);
    fclose(idxfile);
    fclose(avifile);
    int xx = remove("/sdcard/idx.tmp");

    Serial.println("---");
}

static void do_fb()
{
    xSemaphoreTake(baton, portMAX_DELAY);
    camera_fb_t *fb = esp_camera_fb_get();

    // Serial.print("Pic, len="); Serial.println(fb->len);

    esp_camera_fb_return(fb);
    xSemaphoreGive(baton);
}

////////////////////////////////////////////////////////////////////////////////////
//
// some globals for the loop()
//

void stop_handler()
{
    recording = 0;
    Serial.println("stopping recording");

    xTaskNotifyGive(AviWriterTask);
}

void start_handler(char file[200])
{
    delay(500);
    sprintf(fname, "/sdcard/%s.avi", file);
    char buf[120];
    size_t buf_len;
    char new_res[20];

    if (recording == 1)
    {
        const char *resp = "You must Stop recording, before starting a new one.  Start over ...";
    }
    else
    {
        // recording = 1;
        Serial.println("starting recording");

        framesize = 8;
        capture_interval = 100;
        total_frames_config = 18000;
        xlength = total_frames_config * capture_interval / 1000;
        repeat_config = 100;
        quality = 12;
        xspeed = 1;
        gray = 0;
        config_camera();

        recording = 1;
        xTaskNotifyGive(AviWriterTask);
    }
}
